Repository: sahraouilarbi/amgm_glucare
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: About
ar: حول التطبيق
fr: A Propos

# calculateRiskOfPersone
source: Calculate the risk of a person with diabetes before opting for fasting.
ar: احسب خطر إصابة الشخص المصاب بالسكري قبل اختيار الصيام.
fr: Calculer le risque d'une personne atteinte de diabète avant d'opter pour le jeûne.

source: Change Language
ar: تغيير اللغة
fr: Changer de langue

# descriptionShort
source: Our app is designed to help you measure the risk of fasting in patients with diabetes according to the IDF-DAR 2021.
ar: تم تصميم تطبيقنا لمساعدتك في قياس مخاطر الصيام لدى مرضى السكري وفقًا لـ IDF-DAR 2021.
fr: Notre application est conçue pour vous aider à mesurer le risque de jeûne chez les patients diabètiques selon l'IDF-DAR 2021.

# descriptionLong
source: Fasting is the practice of abstaining from food and drink for a period of time. While this practice is associated with several health benefits, it can also lead to complications, especially in patients with diabetes. Diabetes is a chronic disease characterized by elevated blood sugar levels. This elevation can lead to serious complications, particularly at the cardiovascular, renal and ophthalmic levels. Therefore, before undertaking a fast, it is important to measure the risk that this represents for diabetic patients. It is in this context that our application was developed. Our application is accessible to everyone and easy to use. It allows users to enter information about their medical profile, including diabetes type, duration of diabetes, hypoglycemia, glycemic control, macrovascular complications and comorbidities, renal complications and comorbidities, pregnancy, frailty and cognitive function, as well as their previous experience and duration of fasting. Once this information is entered, the application calculates the patient's risk of fasting based on the IDF-DAR. The result is presented as a message, which allows users to easily understand the level of risk associated with fasting. Finally, our app is regularly updated with the latest scientific data and IDF-DAR recommendations. This ensures that users have the most up-to-date information to assess their fasting risk and make informed health decisions. In summary, our app is a valuable tool to help patients with diabetes assess the risk of fasting and make informed health decisions. It is easy to use, accessible to everyone and based on sound scientific data. We are confident that this application will be of great help to diabetic patients and healthcare professionals. All recommendations presented in this application are taken from the IDF-DAR 2021 guidelines.
ar: الصوم هو ممارسة الامتناع عن الطعام والشراب لفترة معينة من الزمن. على الرغم من أن هذه الممارسة مرتبطة بالعديد من الفوائد الصحية ، إلا أنها قد تؤدي أيضًا إلى مضاعفات ، خاصة في مرضى السكري. مرض السكري هو مرض مزمن يتميز بارتفاع مستويات السكر في الدم. يمكن أن يؤدي هذا الارتفاع إلى مضاعفات خطيرة ، لا سيما على مستوى القلب والأوعية الدموية والكلى والعين. لهذا السبب ، قبل الصيام ، من المهم قياس الخطر الذي يمثله ذلك لمرضى السكري. في هذا السياق تم تطوير تطبيقنا. تطبيقنا في متناول الجميع وسهل الاستخدام. يسمح للمستخدمين بإدخال معلومات حول ملفهم الطبي ، بما في ذلك نوع مرض السكري ، ومدة مرض السكري ، ونقص السكر في الدم ، والتحكم في نسبة السكر في الدم ، ومضاعفات الأوعية الدموية الكبيرة والأمراض المصاحبة ، والمضاعفات الكلوية والأمراض المصاحبة ، والحمل ، والضعف ، والوظيفة الإدراكية ، بالإضافة إلى خبرتهم السابقة و مدة الصيام: بمجرد إدخال هذه المعلومات ، يقوم التطبيق بحساب مخاطر صيام المريض بناءً على IDF-DAR. يتم تقديم النتيجة في شكل رسالة ، مما يسهل على المستخدمين فهم مستوى المخاطر المرتبطة بالصيام. أخيرًا ، يتم تحديث تطبيقنا بانتظام وفقًا لأحدث البيانات العلمية والتوصيات الصادرة عن IDF-DAR. يضمن ذلك حصول المستخدمين على أحدث المعلومات لتقييم مخاطر الصيام واتخاذ قرارات صحية مستنيرة. باختصار ، يعد تطبيقنا أداة قيمة لمساعدة مرضى السكري على تقييم مخاطر الصيام واتخاذ قرارات صحية مستنيرة. إنه سهل الاستخدام ومتاح للجميع ويعتمد على بيانات علمية متينة. نحن مقتنعون بأن هذا التطبيق سيكون مفيدًا جدًا لمرضى السكري وأخصائيي الرعاية الصحية. جميع التوصيات المقدمة في هذا الطلب مأخوذة من إرشادات IDF-DAR 2021
fr: Le jeûne est une pratique qui consiste à s'abstenir de manger et de boire pendant une certaine période. Bien que cette pratique soit associée à plusieurs avantages pour la santé, elle peut également entraîner des complications, en particulier chez les patients atteints de diabète. En effet, le diabète est une maladie chronique qui se caractérise par une élévation du taux de sucre dans le sang. Cette élévation peut entraîner des complications graves, notamment au niveau cardiovasculaire, rénal et ophtalmique. C'est pourquoi, avant d'entreprendre un jeûne, il est important de mesurer le risque que cela représente pour les patients diabétiques. C'est dans ce contexte que notre application a été développée. Notre application est accessible à tous et facile à utiliser. Elle permet aux utilisateurs de saisir des informations sur leur profil médical, y compris leur type de diabète, la durée de leur diabète, l'hypoglycémie, le contrôle glycémique, les complications macro-vasculaires et les comorbidités, les complications rénales et les comorbidités, la grossesse, la fragilité et la fonction cognitive, ainsi que leur expérience précédente et la durée du jeûne.Une fois ces informations saisies, l'application calcule le risque de jeûne pour le patient en se basant sur l'IDF-DAR. Le résultat est présenté sous forme de message, ce qui permet aux utilisateurs de comprendre facilement le niveau de risque associé au jeûne. Enfin, notre application est régulièrement mise à jour en fonction des dernières données scientifiques et des recommandations de l'IDF-DAR. Cela garantit que les utilisateurs disposent des informations les plus récentes pour évaluer leur risque de jeûne et prendre des décisions éclairées en matière de santé. En résumé, notre application est un outil précieux pour aider les patients diabétiques à évaluer le risque de jeûne et prendre des décisions éclairées en matière de santé. Elle est facile à utiliser, accessible à tous et basée sur des données scientifiques solides. Nous sommes convaincus que cette application sera d'une grande aide pour les patients diabétiques et les professionnels de santé. Toutes les recommandations présentées dans cette application sont tirées des lignes directrices de l'IDF-DAR 2021

# iDFDAR_01_diabetesType
source: Diabetes type
ar: نوع مرض السكري
fr: Type de diabète

# iDFDAR_02_durationOfDiabetes
source: Duration of diabetes (years)
ar: مدة مرض السكري
fr: Durée du diabète

# iDFDAR_02_durationOfDiabetes_01_GreaterOrEgal10
source: Duration >= 10
ar: مدة>=10
fr: Durée >= 10 ans

# iDFDAR_02_durationOfDiabetes_00_LessThan10
source: Duration < 10
ar: مدة<10
fr: Durée < 10 ans

# iDFDAR_03_hypoglycaemia
source: Presence of hypoglycaemia
ar: نقص السكر في الدم
fr: Hypoglycémie

# iDFDAR_03_hypoglycaemia_65_Unawareness
source: Hypoglycaemia unawareness
ar: لا يشعر نقص السكر في الدم
fr: Hypoglycémie non ressentie

# iDFDAR_03_hypoglycaemia_55_RecentSevere
source: Recent Severe hypoglycaemia
ar: نقص سكر الدم الحاد الأخير
fr: Hypoglycémie sévère récente

# iDFDAR_03_hypoglycaemia_35_MultipleWeekly
source: Multiple weekly Hypoglycaemia
ar: انخفاض سكر الدم الأسبوعي المتكرر
fr: Hypoglycémie hebdomadaire récurrente

# iDFDAR_03_hypoglycaemia_10_LessThan1perWeek
source: Hypoglycaemia less than 1 time per week
ar: نقص سكر الدم أقل من مرة واحدة في الأسبوع
fr: Hypoglycémie < 1 fois par semaine

# iDFDAR_03_hypoglycaemia_00_No
source: No hypoglycaemia
ar: لا نقص السكر في الدم
fr: Pas d'hypoglycémie

# iDFDAR_04_glycemicControl
source: Level of glycaemic control
ar: ضبط نسبة السكر في الدم
fr: Contrôle glycémique

# iDFDAR_05_typeOfTreatment
source: Type of treatment
ar: علاج مرض السكري
fr: Traitement du diabète

# iDFDAR_05_typeOfTreatment_30_MultipleDailyMixedInsulinInjections
source: Multiple daily mixed insulin Injections
ar: حقن الأنسولين يوميًا
fr: Injections quotidiennes multiples d'insuline

# iDFDAR_05_typeOfTreatment_25_BasalBolusOrInsulinPump
source: Basal Bolus/Insulin pump
ar: مضخة الأنسولين / البلعة القاعدية
fr: Bolus basal / pompe à insuline

# iDFDAR_05_typeOfTreatment_20_OneDailyMixedInsulin
source: Once daily Mixed insulin
ar: الأنسولين المختلط مرة واحدة في اليوم
fr: Insuline mixte, 1 fois/jour

# iDFDAR_05_typeOfTreatment_15_BasalInsulin
source: Basal Insulin
ar: الأنسولين القاعدي
fr: Insuline basale

# iDFDAR_05_typeOfTreatment_05_GliclazideOrGlimeprideOrRepeglanide
source: Gliclazide/MR or Glimepride or Repeglanide
fr: Gliclazide/à libération modifiée ou répaglinide ou glimépiride

# iDFDAR_05_typeOfTreatment_00_OtherTherapy
source: Other therapy not including SU or Insulin
ar: علاجات أخرى لا تشمل السلفونيل يوريا أو الأنسولين
fr: Autre traitement ne comportant pas de sufonylurée ou d'insuline

# iDFDAR_06_smbg
source: Self-Monitoring of Blood Glucose (SMBG)
ar: التنظيم الذاتي لنسبة السكر في الدم
fr: Autosurveillance glycémique

# iDFDAR_06_smbg_20_IndicatedButNotConducted
source: Indicated but not conducted
ar: مبين ولكن لم يتم تنفيذه
fr: Indiquée mais pas réalisée

# iDFDAR_06_smbg_10_IndicatedButConducted
source: Indicated but conducted sub-optimally
ar: تمت الإشارة إليها ولكن تم تنفيذها دون المستوى الأمثل
fr: Indiquée mais réalisée de façon sous-optimale

# iDFDAR_06_smbg_00_ConductedAsIndicated
source: Conducted as indicated
ar: تم حسب التوجيهات
fr: Réalisée comme indiquée

# iDFDAR_07_acuteComplications
source: Acute complications
ar: مضاعفات خطيرة
fr: Complications sévères

# iDFDAR_07_acuteComplications_30_DkaHoncInTheLast3Months
source: DKA/HONC in the last 3 months
fr: ACD/SHH dans les 3 derniers mois

# iDFDAR_07_acuteComplications_20_DkaHoncInTheLast6Months
source: DKA/HONC in the last 6 months
fr: ACD/SHH dans les 6 derniers mois

# iDFDAR_07_acuteComplications_10_DkaHoncInTheLast12Months
source: DKA/HONC in the last 12 months
fr: ACD/SHH dans les 12 derniers mois

# iDFDAR_07_acuteComplications_00_NoDkaHonc
source: No DKA or HONC
fr: Pas d'ACD ou SHH

# iDFDAR_08_mvdComplications
source: MVD Complications/Comorbidities
ar: مضاعفات الأوعية الدموية الكبيرة / الأمراض المصاحبة
fr: Complications macrovasculaires/comorbidités

# iDFDAR_08_mvdComplications_65_UnstableMVD
source: Unstable MVD
ar: غير مستقر
fr: Instable

# iDFDAR_08_mvdComplications_20_StableMVD
source: Stable MVD
ar: ثابت
fr: Stable

# iDFDAR_08_mvdComplications_00_NoMVD
source: No MVD
ar: لا توجد مضاعفات
fr: Pas de complications

# iDFDAR_09_renalComplications
source: Renal Complications/Comorbidities
ar: مضاعفات الكلى / الأمراض المصاحبة
fr: Complications rénales/comorbidités

# iDFDAR_10_pregnancy
source: Pregnancy
ar: الحمل
fr: Grossesse

# iDFDAR_10_pregnancy_65_PregnantNotWithinTargets
source: Pregnant not within targets
ar: حامل ليس ضمن الهدف
fr: Enceinte pas dans les objectifs cibles

# iDFDAR_10_pregnancy_35_PregnantWithinTargets
source: Pregnant within targets
ar: حامل ضمن الهدف
fr: Enceinte à l'objectif cible

# iDFDAR_10_pregnancy_00_NotPregnant
source: Not pregnant
ar: غير حامل
fr: Pas enceinte

# iDFDAR_11_frailtyAndCognitiveFunction
source: Frailty and Cognitive function
ar: الإدراك والهشاشة الوظائف المعرفية
fr: Fragilité et fonction cognitive

# iDFDAR_11_frailtyAndCognitiveFunction_65_ImpairedCognitiveFunctionOrFrail
source: Impaired cognitive function or Frail
ar: ضعف الوظائف المعرفية والهشاشة
fr: Alteration des fonctions cognitives et fragilité

# iDFDAR_11_frailtyAndCognitiveFunction_35_moreThan70YearsOldWithNoHomeSupport
source: > 70 years old with no home support
ar: أكثر من 70 سنة بدون مساعدة منزلية
fr: > 70ans sans assistance à domicile

# iDFDAR_11_frailtyAndCognitiveFunction_00_NoFrailtyOrLossInCognitiveFunction
source: No frailty or loss in cognitive function
ar: لا ضعف أو تراجع في الوظائف الإدراكية
fr: Pas de fragilité ou déclin des fonctions cognitives

# iDFDAR_12_physicalLabour
source: Physical Labour
ar: النشاط البدني
fr: Activité physique

# iDFDAR_12_physicalLabour_40_HighlyIntensePhysicalLabour
source: Highly Intense physical labour
ar: النشاط البدني الشديد
fr: Activité physique extrême

# iDFDAR_12_physicalLabour_20_ModerateIntensePhysicalLabour
source: Moderate Intense Physical Labour
ar: النشاط البدني معتدل
fr: Activité physique modérée

# iDFDAR_12_physicalLabour_00_NoPhysicalLabour
source: No physical labour
ar: لا نشاط بدني
fr: Pas d'activité physique

# iDFDAR_13_previousRamadanExperience
source: Previous Ramadan Experience
ar: تجربة رمضان السابقة
fr: Expérience du Ramadan précédent

# iDFDAR_13_previousRamadanExperience_10_OverallNegativeExperience
source: Overall negative experience
ar: تجربة سلبية
fr: Expérience négative

# iDFDAR_13_previousRamadanExperience_00_NoNegativeOrPositiveExperience
source: No negative or positive experience
ar: لا توجد تجربة سلبية/تجربة إيجابية
fr: Pas d'expérience négative/expérience positive

# iDFDAR_14_fastingHours
source: Fasting hours (location)
ar: عدد ساعات الصيام
fr: Nombre d'heures de jeûne (selon la localisation géographique)

# iDFDAR_14_fastingHours_10_moreOrEgalThan16
source: >= 16 hours
ar: أكثر من 16 ساعة
fr: >= 16 heures

# iDFDAR_14_fastingHours_10_lessThan16
source: < 16 hours
ar: أقل من 16 ساعة
fr: < 16 heures

# iDFDAReGFRDescription
source: eGFR: Estimated glomerular filtration rate
ar: eGFR: معدل الترشيح الكبيبي المقدر
fr: eGFR: Débit de filtration glomérulaire estimé

# iDFDARshhDescription
source: Honc: Hyperglycaemic Hyperosmolar Nonketotic Coma
fr: SHH: Syndrome d'hyperosmolarité hyperglycémique

# developpedBy
source: Developed by
ar: المطور
fr: Développer par

# developpedFor
source: For
ar: طور لحساب
fr: Pour le compte de

# developpedForName
source: Association of General Practitioners of the Wilaya of Mostaganem
ar: جمعية الأطباء العامون لولاية مستغانم
fr: Association des Médecins Généraliste de la Wilaya de Mostaganem

source: Error
ar: خطأ
fr: Erreur

source: Error 404
ar: خطأ 404
fr: Erreur 404

# error404Description
source: Page not found
ar: الصفحة غير موجودة
fr: Page non trouvée

# information
source: The result is displayed in the bar at the top. Depending on the gravity, the color of the bar changes.
ar: يتم عرض النتيجة في الشريط العلوي ، ويتغير لون الشريط حسب درجة الخطورة.
fr: Le résultat est affiché dans la barre en haut. Selon la gravité, la couleur de la barre change.

# multilangueAvailable
source: The application is available in French, English, and Arabic.
ar: التطبيق متوفر باللغات الفرنسية والإنجليزية والعربية.
fr: L'application est disponible en français, anglais et arabe.

# resetText
source: To reset the risk calculator to 0, click on the Reset button.
ar: لإعادة تعيين حاسبة المخاطر إلى 0 ، انقر فوق الزر إعادة تعيين
fr: Pour remettre le calculateur de risque à 0, cliquer sur le bouton Reset

source: RISK CALCULATOR
ar: حاسبة المخاطر
fr: CALCULATEUR DE RISQUE

# riskLow
source: Low risk
ar: خطر قليل
fr: Risque faible

# riskModerate
source: Moderate risk
ar: مجازفة معقولة الى حد ما
fr: Risque modéré

# riskHigh
source: High risk
ar: مخاطرة عالية
fr: Risque élevé

source: Settings
ar: إعدادات
fr: Paramètres

source: Start
ar: إبدأ
fr: Commencer

# welcome
source: Welcome to
ar: مرحبًا بكم في
fr: Bienvenue sur

source: Description
ar: وصف التطبيق

# developperName
source: Sahraoui Larbi
ar: صحراوي العربي

source: Important
ar: هام

source: Reset
ar: إعادة تعيين

source: Version
ar: إصدار
